app/controllers/index_controller.rb

SELECT * FROM `posts` WHERE (published = 1) ORDER BY created_at DESC
---
  def index
    @posts = Post.all(:conditions => ['published = ?', false])