app/controllers/messages_controller.rb

SELECT * FROM `messages`
---
  def index
    @messages = Message.all