app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`, `published`) VALUES('2010-03-20 00:59:48', 'asdasd', 'sdfasdfsdf', '2010-03-20 00:59:48', 0)
---
  def create
    @post = Post.new(params[:post])

    if @post.save

UPDATE `posts` SET `updated_at` = '2010-03-19 22:13:38', `title` = '123123', `body` = ']<br><br><br>gdsfgsdfg<br><br><br>dfgdf<b>sgdfg</b>dfsgdfsg<br><br><font size=\"5\">sdfgsdfg</font>dfsgsdfgdfsg<br>' WHERE `id` = 1
---
  def update
    if @post.update_attributes(params[:post])

DELETE FROM `posts` WHERE `id` = 2
---
  def destroy
    @post.destroy

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
---
  def find_post
    @post = Post.find(params[:id])